# VoidCutsGeometry Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..VoidCutsGeometry Property
ParameterTypeId Class See Also
---
"Cuts Geometry"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId VoidCutsGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VoidCutsGeometry As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ VoidCutsGeometry {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace